tests/report/statistics.json
{
  "Get Latest Issues" : {
    "transaction" : "Get Latest Issues",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 250.38699999999974,
    "medianResTime" : 234.0,
    "minResTime" : 9.0,
    "maxResTime" : 786.0,
    "pct1ResTime" : 486.9,
    "pct2ResTime" : 530.9499999999999,
    "pct3ResTime" : 627.98,
    "throughput" : 310.17369727047145,
    "receivedKBytesPerSec" : 1582.2475234568858,
    "sentKBytesPerSec" : 56.643048232009924
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 519.5519999999996,
    "medianResTime" : 290.0,
    "minResTime" : 6.0,
    "maxResTime" : 3452.0,
    "pct1ResTime" : 1500.0,
    "pct2ResTime" : 1967.0,
    "pct3ResTime" : 2474.0,
    "throughput" : 557.7244841048522,
    "receivedKBytesPerSec" : 1165.1251176450085,
    "sentKBytesPerSec" : 178.10147099832685
  },
  "Initiate Issue" : {
    "transaction" : "Initiate Issue",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1037.2490000000005,
    "medianResTime" : 932.0,
    "minResTime" : 21.0,
    "maxResTime" : 3452.0,
    "pct1ResTime" : 2112.7,
    "pct2ResTime" : 2355.1499999999987,
    "pct3ResTime" : 3088.7700000000004,
    "throughput" : 192.01228878648232,
    "receivedKBytesPerSec" : 77.62996831797234,
    "sentKBytesPerSec" : 109.31949644777265
  },
  "Get Stock" : {
    "transaction" : "Get Stock",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 271.0200000000009,
    "medianResTime" : 146.5,
    "minResTime" : 6.0,
    "maxResTime" : 1306.0,
    "pct1ResTime" : 766.0999999999998,
    "pct2ResTime" : 1006.8499999999998,
    "pct3ResTime" : 1129.98,
    "throughput" : 317.8639542275906,
    "receivedKBytesPerSec" : 242.13131506277813,
    "sentKBytesPerSec" : 65.49735775588049
  },
  "Issue Drug Flow" : {
    "transaction" : "Issue Drug Flow",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1558.6569999999986,
    "medianResTime" : 1490.0,
    "minResTime" : 128.0,
    "maxResTime" : 4318.0,
    "pct1ResTime" : 2750.8,
    "pct2ResTime" : 3169.2999999999993,
    "pct3ResTime" : 3766.95,
    "throughput" : 187.4062968515742,
    "receivedKBytesPerSec" : 1174.5142443426723,
    "sentKBytesPerSec" : 179.53669649550224
  }
}